snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	
	ДополнительныеСвойства.Вставить("Начало", ТекущаяУниверсальнаяДатаВМиллисекундах());	
	
	рПроверки = ПроверитьДЗР_РС(ЭтотОбъект);
	Если НЕ рПроверки.Успешно Тогда
		Отказ = Истина;
		ВызватьИсключение СтрСоединить(рПроверки.Ошибки, Символы.ПС) + " Запись движений по регистру 'СтатусыКМ_Факт' запрещена !";
	КонецЕсли;
		
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	
	ЗаполнитьРеквизитыКМ();
	
	локУстановитьСписокПолучателей();	
КонецПроцедуры

Функция локУстановитьСписокПолучателей()	
	Регистратор	= Отбор.Регистратор.Значение;
	
	ТипРегистратора = ТипЗнч(Регистратор);	
	
	Если ЗначениеЗаполнено(Регистратор) Тогда 
		//Валетов+ 23.06.2026 Проблема 0000000134 Отключу проверку ВерсийДанных для ЗакзовНаЭмиссию 
		Если ТипРегистратора = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
			МетаОбъект = Метаданные.НайтиПоТипу(ТипРегистратора);
			Если МетаОбъект<>Неопределено И МетаОбъект.Реквизиты.Найти("КодУзлаСоздания") <> Неопределено Тогда
				Если ПолучитьРеквизитШапки(Регистратор, "КодУзлаСоздания") <> Маркировка_ПИ.ЭтотУзел_Код("Основной") Тогда
					Возврат Ложь; 				
				КонецЕсли; 			
			КонецЕсли;
		Иначе
		//Валетов-
			Если МаркировкаС.ОбъектСуществует(Регистратор) Тогда
				МетаОбъект = Метаданные.НайтиПоТипу(ТипРегистратора);
				Если МетаОбъект<>Неопределено И МетаОбъект.Реквизиты.Найти("КодУзлаСоздания") <> Неопределено Тогда
					Если ПолучитьРеквизитШапки(Регистратор, "КодУзлаСоздания") <> Маркировка_ПИ.ЭтотУзел_Код("Основной") Тогда
						Возврат Ложь; 				
					КонецЕсли; 			
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИмяПланаОбмена	= "ДанныеЧЗ";
	Получатели		= Новый Массив;
	
	Если Маркировка_ПИ.ТипТекущегоУзла() = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
		Если ТипРегистратора = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") 
			ИЛИ ТипРегистратора = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
			Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.Склад, ИмяПланаОбмена);
		ИначеЕсли 
			ТипРегистратора = Тип("ДокументСсылка.УстановкаСтатусаКМ")
			ИЛИ ТипРегистратора = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда		
			Если ПолучитьРеквизитШапки(Регистратор, "КодУзлаСоздания") = Маркировка_ПИ.ЭтотУзел_Код() Тогда
				//Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.Склад);
				Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.Склад, ИмяПланаОбмена);
			КонецЕсли;
		КонецЕсли;	
	Иначе //Периферийная база - отправка в ЦО
		Если ТипРегистратора = Тип("ДокументСсылка.ЛистНабора") 
			ИЛИ ТипРегистратора = Тип("ДокументСсылка.ЛистМаркировки") 
			ИЛИ ТипРегистратора = Тип("ДокументСсылка.ЗаданиеНаМаркировку") 
			ИЛИ ТипРегистратора = Тип("ДокументСсылка.ЗаданиеНаСборкуКомплектовЧЗ") Тогда
			
			Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.УправляющееПодразделение, ИмяПланаОбмена);
		ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.МаркировкаТоваровИСМП")			
			ИЛИ ТипРегистратора = Тип("ДокументСсылка.УстановкаСтатусаКМ") 
			ИЛИ ТипРегистратора = Тип("ДокументСсылка.ХранилищеКодовМаркировки") Тогда
			Если ПолучитьРеквизитШапки(Регистратор, "КодУзлаСоздания") = Маркировка_ПИ.ЭтотУзел_Код() Тогда
				Получатели = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(Перечисления.ТипУзлаИБ.УправляющееПодразделение, ИмяПланаОбмена);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;  
	
	ЭтотУзел = Маркировка_ПИ.ЭтотУзел(ИмяПланаОбмена);
	Для Каждого Получатель Из Получатели Цикл
		Если Получатель <> ЭтотУзел Тогда		
			ОбменДанными.Получатели.Добавить(Получатель);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции //локУстановитьСписокПолучателей()

Процедура ПриЗаписи(Отказ, Замещение)
	ПоследняяПорция = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "ПоследняяПорция", Истина);
	
	Если ПоследняяПорция И НЕ Отказ Тогда
		Регистратор = ЭтотОбъект.Отбор.Регистратор.Значение;
		
		//РегистрыНакопления.ОстаткиДоступныхКМ.ЗаписатьПриходРасходКМ(Регистратор);
		//РегистрыСведений.СтатусыКМ_Факт_А.СформироватьДвижения(Регистратор);
	КонецЕсли; 
	
	Начало = МаркировкаКС.ПолучитьЗначениеПараметра(ДополнительныеСвойства, "Начало");
	Если ЗначениеЗаполнено(Начало) Тогда
		Время = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало) / 1000;
		Если Время > 10 Тогда
			ТекстСообщения = СтрШаблон("Запись НЗ. Регистратор: %1, строк: %2", Регистратор, Количество());
			ЗаписатьВЛог("Запись статусов", ТекстСообщения, "Предупреждение", , , Время);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьРеквизитыКМ()
	Если ЭтотОбъект.Количество() > 0 Тогда
		Реквизиты = ПолучитьРеквизитыКМ();
		
		Сч = 0;
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			Если Запись.ТипШК.Пустая() 
				ИЛИ (Запись.ТипШК = Перечисления.ТипыШтрихКодов.Штука И Запись.Номенклатура.Пустая()) Тогда
				Данные = Реквизиты[Запись.ШтрихКодУпаковки];								
				Если Данные<>Неопределено Тогда
					ЗаполнитьЗначенияСвойств(Запись, Данные, "Номенклатура,ТипШК");			
				КонецЕсли;
								
				Сч = Сч + 1;
			КонецЕсли;
			
			Если Запись.ТипШК <> Перечисления.ТипыШтрихКодов.Штука Тогда
				Запись.Номенклатура	= Неопределено;				
			КонецЕсли;
		КонецЦикла;
		
		Если Сч > 0 Тогда
			ТекстСообщения = СтрШаблон("Дозаполнены рекв.  записи статусов. Регистратор: %1, всего строк: %2, заполнено строк: %3.", ЭтотОбъект.Отбор.Регистратор.Значение, ЭтотОбъект.Количество(), Сч);					
			ЗаписатьВЛог("Отладка.ЗаполнитьРеквизитыКМ",  ТекстСообщения, "Предупреждение");
		КонецЕсли;
	КонецЕсли;
КонецФункции //ЗаполнитьРеквизитыКМ()

Функция ПолучитьРеквизитыКМ()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Движения ИЗ &НЗ КАК НЗ
	|;
	|ВЫБРАТЬ		
	|	ШтрихКодУпаковки КАК ШтрихКодУпаковки,
	|	ВЫБОР 
	|		КОГДА ШтрихКодУпаковки.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука) ТОГДА ШтрихКодУпаковки.Владелец	
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,	
	|	ШтрихКодУпаковки.ТипШК КАК ТипШК	
	|ИЗ
	|	ВТ_Движения
	|ГДЕ
	|	(ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука) И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	ИЛИ
	|	ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.ПустаяСсылка)
	|";
	
	Запрос.УстановитьПараметр("НЗ", ЭтотОбъект);
	
	Результат = Новый Соответствие;
	
	Запрос.УстановитьПараметр("МассивКМ", ЭтотОбъект.ВыгрузитьКолонку("ШтрихКодУпаковки"));	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат[Выборка.ШтрихКодУпаковки] = Новый Структура("Номенклатура,ТипШК", Выборка.Номенклатура, Выборка.ТипШК);			
	КонецЦикла; 	
	
	Возврат Результат;
КонецФункции //ПолучитьРеквизитыКМ()

Функция ПроверитьДЗР_РС(НЗ)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Регистратор = НЗ.Отбор.Регистратор.Значение;
	
	Если НЕ ПараметрыСеанса.ОтключитьКонтрольДЗР Тогда
		ДатаДвижений = Неопределено;
		РасчетнаяДЗ	= Маркировка_ПИ.ПолучитьДЗРдляМаркировки();
		Если ЗначениеЗаполнено(Регистратор) И МаркировкаС.ОбъектСуществует(Регистратор) Тогда
			ДатаДвижений = ПолучитьРеквизитШапки(Регистратор, "Дата");
			РасчетнаяДЗ = ПолучитьДатуЗапретаРедактирования(Регистратор);
		Иначе
			Если НЗ.Количество() > 0 Тогда
				ДатаДвижений = НЗ[0].Период;
			Иначе                           
				ДатаДвижений = ПолучитьДатуДвиженийИзБД(Регистратор);
			КонецЕсли;			
		КонецЕсли;	                            
	
		Если ЗначениеЗаполнено(ДатаДвижений) Тогда			
			Если ДатаДвижений <= РасчетнаяДЗ Тогда				
				ТекстСообщения = СтрШаблон("Нарушение ДЗР ! Регистратор: %1, дата движений: %2, ДЗР: %3.", Регистратор, ДатаДвижений, РасчетнаяДЗ);
				
				Результат.Ошибки.Добавить(ТекстСообщения);
				
				ЗаписатьВЛог("Контроль ДЗР", ТекстСообщения, "Ошибка");
			КонецЕсли;				
		Иначе
			Результат.Ошибки.Добавить("Невозможно проверить ДЗР !");
		КонецЕсли;
	КонецЕсли;

	Результат.Успешно = (Результат.Ошибки.Количество() = 0);	
	
	Возврат Результат;
КонецФункции //ПроверитьДЗР_РС()

Функция ПолучитьДатуДвиженийИзБД(Регистратор)
	Результат = ТекущаяДата(); //Если движений нет в базе - то нечего и проверять
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(Период) КАК Период
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт
	|ГДЕ
	|	Регистратор = &Регистратор
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Период) Тогда
		Результат = Выборка.Период;			
	КонецЕсли;	                   
	
	Возврат Результат;
КонецФункции //ПолучитьДатуДвиженийИзБД(Регистратор)
